---
kind: type
id: T:Autodesk.Revit.DB.FailureResolutionType
source: html/786e6422-f66d-5320-99f9-e530819e50a1.htm
---
# Autodesk.Revit.DB.FailureResolutionType

Enumeration to classify FailureResolutions by nature of operation they perform on failing Elements.

## Syntax (C#)
```csharp
public enum FailureResolutionType
```